/* Задание 2
Используя IntelliJ IDEA, создайте проект.
Дано значение числа pi, которое равно 3,141592653 и значение числа Эйлера е, которое равно
2,7182818284590452. Создайте две переменные, присвойте им значения числа pi и числа е и выведите
их на экран без потери точности.*
* */

package com.itvdn.javastarter.petrov.lesson002;

public class Task002 {
    public static void main(String[] args) {
        double pi = 3.141592653;
        String e = "2.7182818284590452";
        System.out.println(pi);
        System.out.println(e);
    }
}
